web/modules/admin/controllers/IndexController.php

SELECT COUNT(*) FROM `log`
SELECT * FROM `log` ORDER BY `id` DESC LIMIT 10
---
    public function actionWelcome()
    {
        $this->layout = "layout1";
        $query = Log::find();
        $count = $query->count();
        $pages = new Pagination(['totalCount' => $count,'pageSize' => '10']);
        $log = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->orderBy('id desc')
            ->all();

DELETE FROM `menu` WHERE `id`=57
SELECT * FROM `menu` WHERE `id`='57'
---
    public function actionDelete()
    {
        $id = Yii::$app->request->get();
        $menu = new Menu();
        $menu->findOne($id)->delete();