web/modules/admin/controllers/ItemController.php

    public function actionSet($role)
    {
        $auth = Yii::$app->authManager;
        $permission = $auth->getPermissionsByRole($role);

        $items = Menu::find()->asArray()->all();
---
SELECT * FROM `menu`