web/modules/admin/controllers/UserController.php

    public function actionList()
    {
        Yii::$app->user->identity->username;
        $data = User::find();
        $pages = new Pagination(['totalCount' =>$data->count(), 'pageSize' => '15']);

        $user = $data->joinWith('usergroup')->offset($pages->offset)->limit($pages->limit)->all();
---
SELECT COUNT(*) FROM `user`
SELECT `user`.* FROM `user` LEFT JOIN `auth_assignment` ON `user`.`id` = `auth_assignment`.`user_id` LIMIT 15