web/modules/models/AuthItem.php

INSERT INTO `auth_item` (`name`, `type`, `description`, `rule_name`, `data`, `created_at`, `updated_at`) VALUES ('hello21111', 1, '基础管理员角色', NULL, NULL, 1503561224, 1503561224)
---
    public function addItem()
    {
        //实例化AuthManager类
        $auth = Yii::$app->authManager;
        if($this->type == self::T_ROLE){
            $item = $auth->createRole($this->name);
            $item->description = $this->description?:'创建['.$this->name.']角色';
        }else{
            $item = $auth->createPermission($this->name);

UPDATE `auth_item` SET `name`='helloworld1231', `description`='123123', `rule_name`=NULL, `data`=NULL, `updated_at`=1503561632 WHERE `name`='helloworld'
---
    public function updateItem($item_name)
    {
        $auth = Yii:: $app-> authManager;
        if($this->type == self::T_ROLE){
            $item = $auth->createRole($this-> name);
            $item-> description = $this-> description?: '创建['.$this-> name. ']角色';
        }else{
            $item = $auth->createPermission($this-> name);
            $item-> description = $this-> description?: '创建['.$this-> name. ']权限';
        }
        return $auth->update($item_name, $item);