web/modules/models/User.php

    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => self::STATUS_ACTIVE,
        ]);
---
SELECT * FROM `user` WHERE (`id`=1) AND (`status`=10)