web/Helper.php

SELECT COUNT(*) FROM `log`
---
    public static function getHistoryVisNum(){
        $res = Log::find()->count();

SELECT COUNT(*) FROM `log` WHERE `create_time` > 1500860511
---
    public static function getMonthHistoryVisNum(){
        $LastMonth = strtotime("-1 month");
        $res = Log::find()->where(['>','create_time',$LastMonth])->count();